src/cf/InformationRegisters/ЗадачиБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРегулярныхПлатежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроверкиКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
						<v8:Type>cfg:EnumRef.ЗадачиНачалаРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаПредставленияОтчетовУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ВыполнениеЗадачБухгалтераВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Возврат ВыполнениеЗадачБухгалтера.ОписаниеДействия(ПараметрыКоманды);
	
КонецФункции

Функция ПрекратитьВыполнение(Организация, Правило) Экспорт
	
	Если ЗначениеЗаполнено(Правило) Тогда
	
		ПравилоОбъект = Правило.ПолучитьОбъект();
		ПравилоОбъект.Выполняется = Ложь;
		ПравилоОбъект.Записать();
		
		Возврат РегистрыСведений.ЗадачиБухгалтера.УдалитьЗаписиПоПравилу(Организация, Правило);
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;
	
КонецФункции

Функция ПеренестиВАрхив(Знач ПараметрыКоманды) Экспорт
	
	КлючЗаписи = РегистрыСведений.ЗадачиБухгалтера.УстановитьСтатусВыполнено(ПараметрыКоманды);
	ИсторияРаботыПользователя.Добавить(КлючЗаписи);
	
	Возврат КлючЗаписи; // Для оповещения форм и пользователя
	
КонецФункции

Функция ЗарегистрироватьВЖурналеОткрытиеФормы(Знач ИмяФормы) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Открытие ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ИмяФормы);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

Функция ЗарегистрироватьВЖурналеПоказПредупреждения(Знач ТекстПредупреждения) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Показ предупреждения ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ТекстПредупреждения);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

Функция ЗарегистрироватьВЖурналеПереходПоСсылке(Знач Ссылка) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Переход по ссылке ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		Ссылка);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

#КонецОбласти
